from yacs.config import CfgNode as CN

_C = CN()

# -----------------------------------------------------------------------------
# 詳細をここに記述
# -----------------------------------------------------------------------------
_C.SAMPLE_PARAM1 = CN()
_C.SAMPLE_PARAM1.param1 = "test1"
_C.SAMPLE_PARAM1.param2 = 2
_C.SAMPLE_PARAM1.param3 = 3

# -----------------------------------------------------------------------------
# 詳細をここに記述
# -----------------------------------------------------------------------------
_C.SAMPLE_PARAM2 = CN()
_C.SAMPLE_PARAM2.param1 = 1
_C.SAMPLE_PARAM2.param2 = 2
_C.SAMPLE_PARAM2.param3 = 3